<?php
//© A.A.CheckMaRev assminog@gmail.com tubmulur@yandex.ru
//$оСекундомер = new Секундомер::о();
//$оСекундомер->_Стоп();
//print_r($оСекундомер);
class Секундомер
	{
	private  $д4Старт	= 0.00;
	private  $д4Стоп	= 0.00;
	public  $д4Итого 	= 0.00;
	public  $оOценка;											// o20
	public function __construct()                                            		//	><	//  .  .      //////// /
		{                                                                      		//	Роскосмос . >< .
		//switch($сЕсли, $сОценкаДля= ОблакоРегРу480рВМес)                                          /////   ......    //     ////
		//	{                                                              		 //////////    / .      .  /         /
			                                                               		////////....../ .        . /////   / 
		$this->_Старт();                                        //                       .      .
			        					//	              //           ....
			
		//	case 'Стоп':
		//		$this->_Стоп();
		//	break;
		//	$this->оOценка();
		//	}                                                             		  	//	//
		}                                                                       		/////////
	private function _Старт()								     	      ///
		{											// new Скорость
		$this->д4Старт				= д4Время();
		}
	public function _Стоп()
		{
		$this->д4Стоп				= д4Время();

		$this->д4Итого				= $this->д4Стоп - $this->д4Старт;
		$this->д4Итого				= round($this->д4Итого, 4);
							$this->_Оценка();
		}
	private function _Оценка()
		{
		//$this->оOценка				= new Oценка($this->д4Старт);
		//  Значения производительности для хостинга и тарифа, для оценки производительности на платформе, до того, как всё повисло.
		}
	//public static function д4()
	//	{
		//return new Секундомер();
	//	}
	public static function о()
		{
		return new Секундомер();
		}
	}
?>